using DateAccess.Models;
using Microsoft.EntityFrameworkCore;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DateAccess.Data
{
    public static class SeedData
    {
        public static void SeedMovies(this ModelBuilder modelBuilder)
        {
            modelBuilder.Entity<Movie>().HasData(

                new Movie
                {
                    Id = 1,
                    Title = "Оппенгеймер",
                    Description = "У розпал Другої світової війни полковник США Леслі Гровс призначає блискучого фізика-теоретика Роберта Оппенгеймера науковим керівником Манхеттенського проєкту. Вся індустріальна міць та інноваційні технології країни йдуть на те, щоб випередити нацистську Німеччину у створенні зброї масового знищення на основі розщеплення ядра атома. Оппенгеймер проводить успішні випробування першої у світі ядерної бомби, що дозволяє наблизити перемогу у війні. Проте чоловіка мучать докори совісті, оскільки його винахід здатний призвести до знищення всього людства...",
                    ImagePath = "https://uaserials.pro/posters/8215.jpg"                    
                },
                 new Movie
                 {
                     Id = 2,
                     Title = "Творець",
                     Description = "Події розгортаються у майбутньому, під час війни між людьми та штучним інтелектом. Колишній спецпризначенець Джошуа разом із загоном оперативників отримує завдання знайти та вбити архітектора просунутого штучного інтелекту — Творця, який розробив зброю, здатну покласти край не лише війні, а й усьому людству...",
                     ImagePath = "https://uaserials.pro/posters/8224.jpg"                    
                 },

                new Movie
                {
                    Id = 3,
                    Title = "Вбивця",
                    Description = "Висококласний найманий убивця, схильний до мізантропічного філософування, чекає на жертву в Парижі. Коли все йде не за планом, він сам ризикує перетворитися на ціль і вирушає розбиратися зі своїми замовниками...",
                    ImagePath = "https://uaserials.pro/posters/8216.jpg"                    
                },

                new Movie
                {
                    Id = 4,
                    Title = "Привиди у Венеції",
                    Description = "Дія відбувається в 1947 році напередодні Хелловіну у Венеції, куди переїхав знаменитий детектив Еркюль Пуаро, що вийшов на пенсію. На прохання свого старого знайомого він неохоче відвідує спіритичний сеанс самопроголошеного медіума Джойс Рейнольдс, яку потрібно викрити як шахрайку. Незабаром після сеансу жінка-медіум трагічно гине, що змушує гостей, які зібралися в особняку, повірити в існування злих духів. Проте Пуаро переконаний, що сталося сплановане вбивство, яке йому належить розкрити.",
                    ImagePath = "https://uaserials.pro/posters/8174.jpg"                    
                },

                new Movie
                {
                    Id = 5,
                    Title = "Місія нездійсненна: Розплата. Частина перша",
                    Description = "Американський секретний агент Ітан Гант, що очолює оперативну групу «Місія нездійсненна», цього разу стикається з майже невразливим ворогом: штучним інтелектом під назвою «Сутність», що вийшов з-під контролю. Єдиний спосіб перемогти розумну технологію, яка загрожує всьому людству — знайти дві половинки таємничого ключа і розгадати їх секрет. Головний герой та його команда знову повинні кинути виклик смерті та подолати межу власних можливостей, щоб урятувати весь світ від загрози знищення...",
                    ImagePath = "https://uaserials.pro/posters/8127.jpg"                    
                },

                new Movie
                {
                  Id = 6,
                  Title = "Чорна мітка",
                  Description = "У Тіхуані урядовий агент відвідує старого друга Ніка Фальконе, який уже вийшов на пенсію, і просить його повернутися у стрій. Нік має виконати усунути три цілі, які вважаються небезпечними для національної безпеки США. Тим часом агент Управління боротьби з наркотиками Ентоні Ван Овен дізнається, що за вбивством Февзі Полата, відомого через зв'язки із великими злочинними угрупованнями, стоїть Нік. Вийшовши на слід досвідченого агента, Ентоні поєднується з Ніком, щоб зупинити могутнього кримінального ватажка від використання інноваційного пристрою, здатного повністю відключити електроенергію в мегаполісі.",
                  ImagePath = "https://uaserials.pro/posters/8202.jpg"                  
                },

                new Movie
                {
                 Id = 7,
                 Title = "Фатальна жінка",
                 Description = "Лора Еш, беручи участь у викраденні коштовностей, обманює спільників і тікає до Парижа. Там вона стикається зі схожою на неї дівчиною, яка вчиняє самогубство. Лора вирішує скористатися ситуацією і видати загиблу за себе, а себе — за неї. Їй це вдається, але через сім років вона повертається до Парижа під ім'ям Лілі Воттс, вже як дружина нового посла США у Франції. Однак її колишні спільники продовжують пошуки вкрадених коштовностей...",
                 ImagePath = "https://uaserials.pro/posters/8237.jpg"                 
                },

                new Movie
                {
                  Id = 8,
                  Title = "Фантазери",
                  Description = "Тесляр Серджіо та колишня співачка Сабріна закохані одне в одне, але не можуть кинути своїх партнерів через фінансову залежність. Проте ситуація різко змінюється, коли колеги переконують чоловіка, що він виграв три мільйони євро в лотерею. Серджіо одразу ж кидає старе життя та тягне за собою не тільки Сабріну, а й усіх родичів. Коли пара дізнається, що жодного виграшу немає, вони вирішують продовжити брехати своїм сім'ям і вирушають разом з ними в незвичайну подорож Італією. Однак таємне завжди стає явним...",
                  ImagePath = "https://uaserials.pro/posters/8239.jpg"                 
                },
                                    
                new Movie
                {
                 Id = 9,
                 Title = "Стелла в Парижі",
                 Description = "Цього року Стелла закінчує школу. У той час, коли подруги сидять за підручниками, батько йде до іншої, а мати на порозі депресії, Стелла відкриває для себе клубне життя 80-х і шалені нічні тусовки.",
                 ImagePath = "https://uaserials.pro/posters/8201.jpg"                
                },
                
                new Movie
                {
                 Id = 10,
                 Title = "Ілюзія втечі",
                 Description = "Подружня пара Стіне та Тейт разом зі своїм маленьким сином Немо вирішує втекти з Копенгагена, щоб сховатися у віддаленій хатині у безкраїх лісах Швеції, бажаючи налагодити стосунки та знайти спокій. Жінка прагне подолати творчу кризу та закінчити свій перший роман, а чоловік має намір задокументувати їхню «пригоду» у серії подкастів. Перебуваючи в повній ізоляції від зовнішнього світу, подружжя стикається з низкою дивних подій і зустрічає таємничих незнайомців, які неймовірно схожі на них самих...",
                 ImagePath = "https://uaserials.pro/posters/8221.jpg"
                 
                }
                );
        }


        public static void SeedGanre(this ModelBuilder modelBuilder)
        {

            modelBuilder.Entity<Ganre>().HasData(
              new List<Ganre>()
          {
                new Ganre(){ Id=1, GanreName="Бойовик"},
                new Ganre(){ Id=2, GanreName="Пригоди"},
                new Ganre(){ Id=3, GanreName="Історичний"},
                new Ganre(){ Id=4, GanreName="Драма"},
                new Ganre(){ Id=5, GanreName="Жахи"}
          }
            );
        }

        public static void SeedMovieGanre(this ModelBuilder modelBuilder)
        {
            modelBuilder.Entity<MovieGanre>().HasData(
                new List<MovieGanre>()
                {
                    new MovieGanre(){Id=1,MovieId=1, GanreId=1,},
                    //new MovieGanre(){Id=1,MovieId=1, GanreId=2,},
                    //new MovieGanre(){Id=1,MovieId=1, GanreId=3,},

                    new MovieGanre(){Id=2,MovieId=2, GanreId=2,},
                    //new MovieGanre(){Id=2,MovieId=2, GanreId=3,},
                    //new MovieGanre(){Id=2,MovieId=2, GanreId=1,},

                    new MovieGanre(){Id = 3, MovieId=3, GanreId=1,},
                    //new MovieGanre(){Id = 3, MovieId=3, GanreId=2,},
                    //new MovieGanre(){Id = 3, MovieId=3, GanreId=3,},

                    new MovieGanre(){Id = 4, MovieId=4, GanreId=2,},
                    //new MovieGanre(){Id = 4, MovieId=4, GanreId=3,},
                    //new MovieGanre(){Id = 4, MovieId=4, GanreId=4,},

                    new MovieGanre(){Id = 5, MovieId=5, GanreId=5,},
                    //new MovieGanre(){Id = 5, MovieId=5, GanreId=1,},

                    new MovieGanre(){Id = 6, MovieId=6, GanreId=1,},
                    //new MovieGanre(){Id = 6, MovieId=6, GanreId=4,},


                    new MovieGanre(){Id = 7, MovieId=7, GanreId=2,},

                    //new MovieGanre(){Id = 7, MovieId=7, GanreId=3,},
                    //new MovieGanre(){Id = 8, MovieId=8, GanreId=3,},

                    //new MovieGanre(){Id = 8, MovieId=8, GanreId=1,},
                    //new MovieGanre(){Id = 8, MovieId=8, GanreId=2,},

                    new MovieGanre(){Id = 9, MovieId=9, GanreId=4,},

                    //new MovieGanre(){Id = 9, MovieId=9, GanreId=3,},
                    //new MovieGanre(){Id = 9, MovieId=9, GanreId=5,},

                    new MovieGanre(){Id = 10, MovieId=10, GanreId=5,}

                    //new MovieGanre(){Id = 10, MovieId=10, GanreId=3,},
                    //new MovieGanre(){Id = 10, MovieId=10, GanreId=2,}
                }
                );
        }


        }
}
